Revit 2027 API
ParameterTypeId.BoundaryXTranslationSpring Property
 "X Translation - Spring"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BoundaryXTranslationSpring { get; }
Public Shared ReadOnly Property BoundaryXTranslationSpring As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BoundaryXTranslationSpring {
	ForgeTypeId^ get ();
}
static member BoundaryXTranslationSpring : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace